![](https://i.imgur.com/JsMvGnP.png)


## Exercícios de manipulação de dados - Parte 3

Neste Jupyter notebook você irá resolver uma exercícios utilizando a linguagem Python e a biblioteca Pandas.

Todos os datasets utilizados nos exercícios estão salvos na pasta **datasets**.

Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

### Tarefa 1. Importe o dataset e salve os dados em um dataframe

Os dados estão salvos no arquivo ***datasets/users_dataset.txt***.

Salve os dados em uma variável de nome *users*.

In [1]:
import pandas as pd
users = pd.read_csv('datasets/users_dataset.csv', sep='|')
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Tarefa 2. Descubra qual a idade média por ocupação.

*Dica: use a função groupby do Pandas na coluna occupation*

In [2]:
users[['occupation','age']].groupby(['occupation']).mean().head(10)

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000

### Tarefa 3. Para cada ocupação descubra a idade mínima e máxima.

In [3]:
users[['occupation', 'age']].groupby(['occupation']).max().head()

               age
occupation
administrator   70
artist          48
doctor          64
educator        63
engineer        70

In [4]:
users[['occupation', 'age']].groupby(['occupation']).min().head()

               age
occupation
administrator   21
artist          19
doctor          28
educator        23
engineer        22

### Tarefa 4. Para cada combinação de ocupação e sexo, calcule a idade média.

Exemplo:

```
occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
```

In [5]:
users[['occupation', 'gender', 'age']].groupby(['occupation', 'gender']).mean().head(4)

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333

### Tarefa 5. Para cada ocupação calcule a porcentagem de homens e mulheres.

Exemplo:

```
occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
```

In [6]:
agrupamento = users[['occupation', 'gender', 'age']].groupby(['occupation', 'gender']).count()

agrupamento.groupby(level=0).apply(lambda x: 100*x / float(x.sum())).head(7)

                             age
occupation    gender
administrator F        45.569620
              M        54.430380
artist        F        46.428571
              M        53.571429
doctor        M       100.000000
educator      F        27.368421
              M        72.631579

**Parabéns! Você chegou ao fim!**